---
kind: type
id: T:Autodesk.Revit.DB.ExternalService.ServerChangeCause
source: html/02016116-f6cf-5d3a-94df-811ef76bdebc.htm
---
# Autodesk.Revit.DB.ExternalService.ServerChangeCause

Indicates the cause for the active server to be changed

## Syntax (C#)
```csharp
public enum ServerChangeCause
```